# В данной задаче необходимо сравнить два целых числа A и B. Они поступают на вход программе отдельно в каждой строке.
# Ваша задача вывести символ <, если A меньше B, >, если A больше B и =, если A=B.
#
# a = int(input())
# b = int(input())
# if a < b:
#     print("<")
# elif a > b:
#     print(">")
# elif a == b:
#     print("=")
#-----------------------

# Даны три целых числа, каждое записано в отдельной строке.
# Нужно вывести значение наибольшего из данных чисел
# Примечание: используйте только условный оператор, функцией max пользоваться нельзя.
#
# a = int(input())
# b = int(input())
# c = int(input())
# if a < b > c:
#     print(b)
# elif b < a > c:
#     print(a)
# elif a < c > b:
#     print(c)