# brothers = ["Aibulat", "Salavat", "Ильяс", "Airas", "Azat", "Ilfir", "Айсылу"]
# data = "Салам"
# data.upper()
# print(data.upper())
# print(brothers)
# brothers.sort()
# # brothers.sort(reverse=True)
# print(brothers)

# data = "Python developer"
# # for name in brothers:
# #     print(f"Hello, {name}!")
#
#
# # print(len(brothers))
# # print(brothers[0])
# # print(brothers)
# # brothers.pop(0)
# # print(brothers)
# # print(len(brothers))
# while len(brothers):
#     print(f"Salam {brothers[0]}")
#     # print(brothers)
#     brothers.pop(0)
#     # print(len(brothers))
#
# print(f"Ostatok v spiske {brothers}")
#
#-------------------------
# Сохраните в переменной  my_list список, в котором должно быть 77 элемента и все они представляют собой единицу
# [1, 1, ... , 1] После этого выведите переменную my_list на экран.
# 
# my_list = [1]*77
# print(my_list)

#-------------------------
# Допишите программу ниже, чтобы она вывела через пробел в одной строке значения самого маленького и самого большого элементов списка my_list.
#
# my_list = [-214, 181, -139, 448, -664, -66, 213, 832, 717, -462, -924, -706, -85, -244, -222, -340, -482, -518, -781, 759, -593, 905, -354, -377, -141, -742, 383, -381, 109, -639, -480, -810, -686, 892, -612, 696, 993, 791, 631, -493, -218, -829, -275, 619, -628, -241, -565, -835, -69, 747, 711, -252, -811, -407, -153, 904, 933, -254, 307, -493, -419, -109, -543, 155, -127, 613, -452, -459, 856, 562, 333, -66, -77, -598, -779, -278, 867, 321, -20, -415, -357, 735, -906, -14, -370, 453, -630, -736, -830, -917, 32, 422, -895, 198, 284, 472, -986, -964, -989, 29]
# print(min(my_list), max(my_list))

#-------------------------
# Программа получает на вход список из целых чисел. Ваша задача вывести True в случае, если в данном списке встречается значение 777. В противном случае вывести False
# Примечание:
# Чтобы прочитать из ввода целые числа и сохранить их в виде списка в переменной my_list вам необходимо написать строчку my_list = list(map(int, input().split()))
#
# my_list = list(map(int, input().split()))
# print(777 in my_list)