# Функции trunc, floor, ceil.
# Функция trunc выполняет отсечение дробной части и оставляет только целую часть числа
# Функция floor выполняет округление вниз до ближайшего целого числа
# Функция ceil выполняет округление вверх до ближайшего целого числа

# -------------------------
# Портос хочет украсить золотым шитьем свою перевязь. Он знает, что один сантиметр золотого шитья стоит один луидор.
# Портосу надо вышить N миллиметров перевязи. Причем мастер никогда не возьмется за работу, если ему заплатят меньше,
# чем стоит работа. И сдачу мастер никогда не отдает.
# Какое минимальное количество луидоров Портос должен заплатить мастеру за работу?
# Входные данные
# Программе на вход поступает натуральное число N (N ≤ 109) – длина перевязи в миллиметрах.

import math

# x = int(input())
# y = x / 10
# print(math.ceil(y))

# После вечеринки компания из N человек хочет добраться домой с помощью такси. Максимальное количество человек,
# которое может уместиться в машину равно 4. Сколько машин придется вызвать ребятам, чтобы все могли уехать?
# x = int(input())
# print(math.ceil(x / 4))
