# import math
# a = int(input())
# b = int(input())
# c = int(input())
# p = (a + b + c)/2
# s = math.sqrt(p * (p - a) * (p - b) * (p - c))
# print(s)

# Программа должна вывести True, если введенное значение является положительным числом, в противном случае - False.
# x = int(input())
# print(x>0)

# Программа должна вывести True, если введенное значение является четным числом, в противном случае - False.
# x = int(input())
# print(x > 0)

# Программа должна вывести True, если введенное значение кратно 6 (без остатка делится на 6), в противном случае - False
# x = int(input())
# a = x % 2
# print(a == 0)

# Программа должна вывести True, если введенное значение не делится на 9, в противном случае - False.
# x = int(input())
# a = x % 9
# print(a != 0)

# Программа должна вывести True, если у введенного числа последняя цифра 2, в противном случае - False.
# x = int(input())
# a = x % 10
# print(a == 2)

# На вход программе поступают два целых числа в одной строке.
# Программа должна вывести True, если оба числа делятся на 7, в противном случае - False.
# x, y = map(int, input().split())
# a = x % 7
# b = y % 7
# print(a == 0 and b == 0)

# На вход поступают три целых числа - стороны треугольника.
# Необходимо вывести True, если данные стороны образуют правильный треугольник, в противном случае - False.
# a, b, c = map(int, input().split())
# print(a == b == c)

# Программа должна вывести True, если введенное значение принадлежит интервалу от 5 не включительно до 19 включительно , в противном случае - False.
# x = int(input())
# print(5 < x <= 19)


print("Hello")